app/controllers/boards_controller.rb

  def index
    @boards = Board.paginate(page: params[:page], per_page: 10).order(created_at: :desc)
---
SELECT "boards".* FROM "boards" ORDER BY "boards"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "boards"

  def set_board
    @board = Board.find_by_id(params[:id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]